InformationRegisters/СкидкиНаПродукты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СкидкиНаПродукты</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СкидкиДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СкидкиДоговора</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныБлюд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ЦеныБлюд</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Блюдо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ПерерасчетСуммСервер/Ext/Module.bsl
Функция МожетБытьДробнымНаСервере(ЕдиницаИзмерения) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ 
	|	ЕдиницаИзмерения.МожетБытьДробным 
	|ИЗ 
	|	Справочник.ЕдиницаИзмерения КАК ЕдиницаИзмерения 
	|ГДЕ 
	|	ЕдиницаИзмерения.Ссылка = &Ссылка");
		
	Запрос.УстановитьПараметр("Ссылка", ЕдиницаИзмерения);
		
	Выборка = Запрос.Выполнить().Выбрать();
 	Выборка.Следующий();
	
	МожетБытьДробным = Выборка.МожетБытьДробным;
	
	Возврат МожетБытьДробным; 

КонецФункции 

Функция ПолучитьСкидкуНаСервере(Договор) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ 
	|	Договора.ВариантСкидки 
	|ИЗ 
	|	Справочник.Договора КАК Договора 
	|ГДЕ 
	|	Договора.Ссылка = &Ссылка");
		
	Запрос.УстановитьПараметр("Ссылка", Договор);
		
	Выборка = Запрос.Выполнить().Выбрать();
 	Выборка.Следующий();
	
	ВариантСкидки = Выборка.ВариантСкидки;
	
	Возврат ВариантСкидки;
	
КонецФункции

Функция ПолучитьСкидкиНаПродуктыНаСервере(МассивПродуктов, Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|   Скидки.Продукт КАК Продукт, 
	|   Скидки.Скидка КАК Скидка 
	|ИЗ
	|   РегистрСведений.СкидкиНаПродукты.СрезПоследних(&ДатаДокумента, Продукт В (&Продукты)) КАК Скидки";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Продукты", МассивПродуктов);
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Продукт, Выборка.Скидка);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьСкидкуИзДоговораНаСервере(Договор, Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СкидкиДоговораСрезПоследних.Скидка КАК Скидка
	|ИЗ
	|	РегистрСведений.СкидкиДоговора.СрезПоследних(&ДатаДокумента,) КАК СкидкиДоговораСрезПоследних
	|ГДЕ
	|	СкидкиДоговораСрезПоследних.Договор.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
 	Выборка.Следующий();
	
	Скидка = Выборка.Скидка;
	
	Возврат Скидка;
КонецФункции

Функция ПолучитьЦеныНаБлюдаНаСервере(МассивБлюд, Дата) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|   Цены.Блюдо КАК Блюдо, 
	|   Цены.Цена КАК Цена 
	|ИЗ
	|   РегистрСведений.ЦеныБлюд.СрезПоследних(&ДатаДокумента, Блюдо В (&Блюда)) КАК Цены";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Блюда", МассивБлюд);
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Блюдо, Выборка.Цена);
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции
